//
// Created by AA on 2022/7/15.
//

#include "tools.h"



struct ACTkByte4
{
    char b1; // 0x0
    char b2; // 0x1
    char b3; // 0x2
    char b4; // 0x3
};

struct ACTkByte8
{
    char b1; // 0x0
    char b2; // 0x1
    char b3; // 0x2
    char b4; // 0x3
    char b5; // 0x3
    char b6; // 0x3
    char b7; // 0x3
    char b8; // 0x3
};
struct ACTkByte16
{
    char b1; // 0x0
    char b2; // 0x1
    char b3; // 0x2
    char b4; // 0x3
    char b5; // 0x3
    char b6; // 0x3
    char b7; // 0x3
    char b8; // 0x3
    char b9; // 0x0
    char b10; // 0x1
    char b11; // 0x2
    char b12; // 0x3
    char b13; // 0x3
    char b14; // 0x3
    char b15; // 0x3
    char b16; // 0x3
};